In [153]:
import pandas as pd

In [154]:
df = pd.DataFrame({
        'First': ['jose', 'atlin', 'babu'],
        'last': ['jose', 'atlin', 'babu'],
        'email': ['Jose@gmail.com', 'Atlin@gmail.com', 'Babu@gmail.com']
    })

In [155]:
df.columns

Index(['First', 'last', 'email'], dtype='object')

In [156]:
df.columns = ['first_name', 'last_name', 'email']  #renaming without using any built_in functions
df

  first_name last_name            email
0       jose      jose   Jose@gmail.com
1      atlin     atlin  Atlin@gmail.com
2       babu      babu   Babu@gmail.com

In [157]:
df.columns = [x.upper() for x in df.columns]    # capitalise the column values
df

  FIRST_NAME LAST_NAME            EMAIL
0       jose      jose   Jose@gmail.com
1      atlin     atlin  Atlin@gmail.com
2       babu      babu   Babu@gmail.com

In [158]:
df.columns = df.columns.str.replace('_', ' ')   # to format the column values
df

  FIRST NAME LAST NAME            EMAIL
0       jose      jose   Jose@gmail.com
1      atlin     atlin  Atlin@gmail.com
2       babu      babu   Babu@gmail.com

In [159]:
df.rename(columns={'FIRST NAME': 'first', 'LAST NAME': 'last', 'EMAIL': 'email'}, inplace=True)
df                                             # rename is another built_in method to change the column values

   first   last            email
0   jose   jose   Jose@gmail.com
1  atlin  atlin  Atlin@gmail.com
2   babu   babu   Babu@gmail.com

In [160]:
df.loc[0] = ['jose', 'atlin', 'Atlin@gmail.com']            # select a row and change all the values by passing a
df                                                          # list of all the values correspoding to the columns

   first   last            email
0   jose  atlin  Atlin@gmail.com
1  atlin  atlin  Atlin@gmail.com
2   babu   babu   Babu@gmail.com

In [161]:
df.loc[0, ['last', 'email']] = ['jose', 'Jose@gmail.com']   # changing certain columns of a row only
df

   first   last            email
0   jose   jose   Jose@gmail.com
1  atlin  atlin  Atlin@gmail.com
2   babu   babu   Babu@gmail.com

In [162]:
df.loc[0, 'last'] = 'atlin'                 # changing a single column value
df

   first   last            email
0   jose  atlin   Jose@gmail.com
1  atlin  atlin  Atlin@gmail.com
2   babu   babu   Babu@gmail.com

In [163]:
filt = (df['email'] == 'Jose@gmail.com')    # filtering a row and changing the column value of a specific value
df.loc[filt, 'last'] = 'jose'               # of that row
df

   first   last            email
0   jose   jose   Jose@gmail.com
1  atlin  atlin  Atlin@gmail.com
2   babu   babu   Babu@gmail.com

In [164]:
df['email'] = df['email'].str.lower()      # changing the values of email to lower case
df

   first   last            email
0   jose   jose   jose@gmail.com
1  atlin  atlin  atlin@gmail.com
2   babu   babu   babu@gmail.com

In [165]:
def update_email(email):
    return email.upper()

df['email'] = df['email'].apply(update_email)       # apply applies the funton to series (columns), for individual
df                                                  # values we can use apply_map function

   first   last            email
0   jose   jose   JOSE@GMAIL.COM
1  atlin  atlin  ATLIN@GMAIL.COM
2   babu   babu   BABU@GMAIL.COM

In [166]:
df['email'] = df['email'].apply(lambda x : x.lower())
df

   first   last            email
0   jose   jose   jose@gmail.com
1  atlin  atlin  atlin@gmail.com
2   babu   babu   babu@gmail.com

In [167]:
df.apply(len, axis='rows')              # returns the no. of rows in the dataframe
# df.apply(len, axis='columns')         # returns the no. of columns in the dataframe

first    3
last     3
email    3
dtype: int64

In [168]:
df.apply(pd.Series.min)                 # both returns the lexicographically smallest string (in case of strings),
# df.apply(lambda x: x.min())           # smallest integer (in case of integer datatype)

first              atlin
last               atlin
email    atlin@gmail.com
dtype: object

In [169]:
df.applymap(len)                        # applies len to every values in the dataframe

   first  last  email
0      4     4     14
1      5     5     15
2      4     4     14

In [170]:
df

   first   last            email
0   jose   jose   jose@gmail.com
1  atlin  atlin  atlin@gmail.com
2   babu   babu   babu@gmail.com

In [171]:
df['first'].map({'jose': 'babu', 'atlin': 'babu'})  # another method to change the value is map
                                                    # but if some value is not given, it will be 
                                                    # place as NaN

0    babu
1    babu
2     NaN
Name: first, dtype: object

In [172]:
df['first'] = df['first'].replace({'jose': 'babu', 'atlin': 'jose'})
df

  first   last            email
0  babu   jose   jose@gmail.com
1  jose  atlin  atlin@gmail.com
2  babu   babu   babu@gmail.com